Book/app/views/notes/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."note_id" = ?  [["note_id", 37]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."note_id" = ?  [["note_id", 3]]
---
    <div class="average-review-rating" data-score=<%= @average_review %>></div>
    <span class="number-of-reviews">Based on <%= @note.reviews.count %> reviews</span>