Book/app/controllers/notes_controller.rb

	def index
	  if params[:category].blank?
		@notes = Note.all.order("created_at DESC")
	  else
		@category_id = Category.find_by(name: params[:category]).id

		@notes = Note.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "notes".* FROM "notes" ORDER BY created_at DESC
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fantasy"], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."category_id" = ? ORDER BY created_at_DECS  [["category_id", 1]]

	def new
		@note = current_user.notes.build
		@categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

	def create
		@note = current_user.notes.build(note_params)
		@note.category_id = params[:category_id]

		if @note.save
---
INSERT INTO "notes" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id", "note_img_file_name", "note_img_content_type", "note_img_file_size", "note_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@note.category_id = params[:category_id]

		if @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "The princile of object oriented javascript"], ["updated_at", "2021-01-27 03:32:56.824015"], ["id", 8]]

	 def find_note
	 	@note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]