Book/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "note_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 4], ["comment", "wellll!"], ["created_at", "2021-01-28 11:16:51.208481"], ["updated_at", "2021-01-28 11:16:51.208481"], ["user_id", 4], ["note_id", 9]]
---
	def create
		@review = Review.new(review_params)
		@review.note_id = @note.id
		@review.user_id = current_user.id

		if @review.save

UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "well expliend!!"], ["updated_at", "2021-01-27 10:44:18.950091"], ["id", 1]]
---
	def update

		if @review.update(review_params)

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
	  def find_note
	  	@note = Note.find(params[:note_id])